<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
data.aws_ecr_repository.repository: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.redis.data.aws_vpc.vpc: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
module.ecs.data.aws_vpc.vpc: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z09669243E0Q6ZCWCIW2U]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.redis.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.redis.data.aws_subnets.private_subnets: Reading...
module.ecs.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.redis.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.ecs.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.data.aws_subnets.public_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:26" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:20" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - dependsOn        = [
                      - {
                          - condition     = "START"
                          - containerName = "aws-otel-collector"
                        },
                    ]
                  - environment      = [
                      - {
                          - name  = "INFURA_PROJECT_ID"
                          - value = "9861a40ac15f47758d54f66a14a8f8b2"
                        },
                      - {
                          - name  = "POKT_PROJECT_ID"
                          - value = "62ff3f53852035003a873d84"
                        },
                    ]
                  - essential        = true
                  - image            = "898587786287.dkr.ecr.eu-central-1.amazonaws.com/rpc-proxy"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "staging_rpc-proxy_logs"
                          - awslogs-region        = "eu-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "staging_rpc-proxy"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - command          = [
                      - "--config=/etc/ecs/ecs-amp-prometheus.yaml",
                    ]
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_PROMETHEUS_ENDPOINT"
                          - value = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65/api/v1/remote_write"
                        },
                      - {
                          - name  = "AWS_PROMETHEUS_SCRAPING_ENDPOINT"
                          - value = "0.0.0.0:3000"
                        },
                    ]
                  - essential        = true
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "True"
                          - awslogs-group         = "/ecs/staging_rpc-proxy-ecs-aws-otel-sidecar-collector"
                          - awslogs-region        = "eu-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "aws-otel-collector"
                  - portMappings     = []
                  - volumesFrom      = []
                },
            ]
        ) -> (sensitive) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 20 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_security_group.tls_ingess will be updated in-place
  ~ resource "aws_security_group" "tls_ingess" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "staging_rpc-proxy - Allow all egress"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0f3c213ea19bfc4d7"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "staging_rpc-proxy - TLS from everywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "staging_rpc-proxy-tls-ingress"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.vpc_app_ingress will be updated in-place
  ~ resource "aws_security_group" "vpc_app_ingress" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "staging_rpc-proxy - App to VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0fdb388e2b1c042d3"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3000
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "staging_rpc-proxy - App from VPC"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
        ]
        name                   = "staging_rpc-proxy-vpc-ingress-to-app"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.redis.aws_elasticache_cluster.cache will be created
  + resource "aws_elasticache_cluster" "cache" {
      + apply_immediately        = (known after apply)
      + arn                      = (known after apply)
      + availability_zone        = (known after apply)
      + az_mode                  = (known after apply)
      + cache_nodes              = (known after apply)
      + cluster_address          = (known after apply)
      + cluster_id               = "staging-rpc-proxy-rpc"
      + configuration_endpoint   = (known after apply)
      + engine                   = "redis"
      + engine_version           = "6.x"
      + engine_version_actual    = (known after apply)
      + id                       = (known after apply)
      + maintenance_window       = (known after apply)
      + node_type                = "cache.m6g.large"
      + num_cache_nodes          = 1
      + parameter_group_name     = "default.redis6.x"
      + port                     = 6379
      + replication_group_id     = (known after apply)
      + security_group_ids       = (known after apply)
      + security_group_names     = (known after apply)
      + snapshot_retention_limit = 2
      + snapshot_window          = (known after apply)
      + subnet_group_name        = "staging-rpc-proxy-rpc-private-subnet-group"
      + tags_all                 = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.redis.aws_elasticache_subnet_group.private_subnets will be created
  + resource "aws_elasticache_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "staging-rpc-proxy-rpc-private-subnet-group"
      + subnet_ids  = [
          + "subnet-006f9fc131af3565e",
          + "subnet-05894f2d41c0e8b45",
          + "subnet-06557bf48886434f1",
        ]
      + tags_all    = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.redis.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "staging_rpc-proxy-rpc - egress to application"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "staging_rpc-proxy-rpc - ingress from application"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "staging_rpc-proxy-rpc-redis-service-ingress"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-09dce0b23af575478"
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.o11y.grafana_data_source.prometheus,
  on monitoring/main.tf line 21, in resource "grafana_data_source" "prometheus":
  21: resource "grafana_data_source" "prometheus" {

Use json_data_encoded instead. It supports arbitrary JSON data, and therefore
all attributes.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*